iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32F7xx/emptyTargetInit/STM32F7_sfr.h
};

#define System_Control_Space_NVIC (*(volatile struct System_Control_Space_NVIC_tag *) 0xe000e100)

struct System_Control_Space_SysTick_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_RVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t reservedSpace0:6;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CALIB;

};

#define System_Control_Space_SysTick (*(volatile struct System_Control_Space_SysTick_tag *) 0xe000e010)

struct System_Control_Space_Memory_Protection_Unit_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEPARATE:1;
      uint64_t reservedSpace0:7;
      uint64_t DREGION:8;
      uint64_t IREGION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t HFNMIENA:1;
      uint64_t PRIVDEFENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_CTRL;

  uint8_t MPU_RNR;
  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A3;

};

#define System_Control_Space_Memory_Protection_Unit (*(volatile struct System_Control_Space_Memory_Protection_Unit_tag *) 0xe000ed90)

struct RNG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RNGEN:1;
      uint64_t IE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRDY:1;
      uint64_t CECS:1;
      uint64_t SECS:1;
      uint64_t reservedSpace0:2;
      uint64_t CEIS:1;
      uint64_t SEIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RNDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

};

#define RNG (*(volatile struct RNG_tag *) 0x50060800)

struct HASH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t INIT:1;
      uint64_t DMAE:1;
      uint64_t DATATYPE:2;
      uint64_t MODE:1;
      uint64_t ALGO0:1;
      uint64_t NBW:4;
      uint64_t DINNE:1;
      uint64_t MDMAT:1;
      uint64_t reservedSpace1:2;
      uint64_t LKEY:1;
      uint64_t reservedSpace2:1;
      uint64_t ALGO1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAIN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBLW:5;
      uint64_t reservedSpace0:3;
      uint64_t DCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DINIE:1;
      uint64_t DCIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DINIS:1;
      uint64_t DCIS:1;
      uint64_t DMAS:1;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  uint8_t res0[208];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR8:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR9:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR10:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR11:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR12:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR13:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR14:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR15:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR16:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR17:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR18:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR19:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR20:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR21:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR22:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR23:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR24:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR25:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR26:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR27:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR28:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR29:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR30:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR31:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR33:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR34:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR35:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR36:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR37:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR38:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR39:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR40:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR41:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR42:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR43:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR44:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR45:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR46:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR47:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR48:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR49:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR50:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR51:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR52:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR53:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR53;

  uint8_t res1[320];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR7;

