iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32F7xx/emptyTargetInit/STM32F7_sfr.h
};

#define DMA1 (*(volatile struct DMA1_tag *) 0x40026000)

struct RCC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSION:1;
      uint64_t HSIRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t HSITRIM:5;
      uint64_t HSICAL:8;
      uint64_t HSEON:1;
      uint64_t HSERDY:1;
      uint64_t HSEBYP:1;
      uint64_t CSSON:1;
      uint64_t reservedSpace1:4;
      uint64_t PLLON:1;
      uint64_t PLLRDY:1;
      uint64_t PLLI2SON:1;
      uint64_t PLLI2SRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLM0:1;
      uint64_t PLLM1:1;
      uint64_t PLLM2:1;
      uint64_t PLLM3:1;
      uint64_t PLLM4:1;
      uint64_t PLLM5:1;
      uint64_t PLLN0:1;
      uint64_t PLLN1:1;
      uint64_t PLLN2:1;
      uint64_t PLLN3:1;
      uint64_t PLLN4:1;
      uint64_t PLLN5:1;
      uint64_t PLLN6:1;
      uint64_t PLLN7:1;
      uint64_t PLLN8:1;
      uint64_t reservedSpace0:1;
      uint64_t PLLP0:1;
      uint64_t PLLP1:1;
      uint64_t reservedSpace1:4;
      uint64_t PLLSRC:1;
      uint64_t reservedSpace2:1;
      uint64_t PLLQ0:1;
      uint64_t PLLQ1:1;
      uint64_t PLLQ2:1;
      uint64_t PLLQ3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW0:1;
      uint64_t SW1:1;
      uint64_t SWS0:1;
      uint64_t SWS1:1;
      uint64_t HPRE:4;
      uint64_t reservedSpace0:2;
      uint64_t PPRE1:3;
      uint64_t PPRE2:3;
      uint64_t RTCPRE:5;
      uint64_t MCO1:2;
      uint64_t I2SSRC:1;
      uint64_t MCO1PRE:3;
      uint64_t MCO2PRE:3;
      uint64_t MCO2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYF:1;
      uint64_t LSERDYF:1;
      uint64_t HSIRDYF:1;
      uint64_t HSERDYF:1;
      uint64_t PLLRDYF:1;
      uint64_t PLLI2SRDYF:1;
      uint64_t PLLSAIRDYF:1;
      uint64_t CSSF:1;
      uint64_t LSIRDYIE:1;
      uint64_t LSERDYIE:1;
      uint64_t HSIRDYIE:1;
      uint64_t HSERDYIE:1;
      uint64_t PLLRDYIE:1;
      uint64_t PLLI2SRDYIE:1;
      uint64_t PLLSAIRDYIE:1;
      uint64_t reservedSpace0:1;
      uint64_t LSIRDYC:1;
      uint64_t LSERDYC:1;
      uint64_t HSIRDYC:1;
      uint64_t HSERDYC:1;
      uint64_t PLLRDYC:1;
      uint64_t PLLI2SRDYC:1;
      uint64_t PLLSAIRDYC:1;
      uint64_t CSSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOARST:1;
      uint64_t GPIOBRST:1;
      uint64_t GPIOCRST:1;
      uint64_t GPIODRST:1;
      uint64_t GPIOERST:1;
      uint64_t GPIOFRST:1;
      uint64_t GPIOGRST:1;
      uint64_t GPIOHRST:1;
      uint64_t GPIOIRST:1;
      uint64_t GPIOJRST:1;
      uint64_t GPIOKRST:1;
      uint64_t reservedSpace0:1;
      uint64_t CRCRST:1;
      uint64_t reservedSpace1:8;
      uint64_t DMA1RST:1;
      uint64_t DMA2RST:1;
      uint64_t DMA2DRST:1;
      uint64_t reservedSpace2:1;
      uint64_t ETHMACRST:1;
      uint64_t reservedSpace3:3;
      uint64_t OTGHSRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMIRST:1;
      uint64_t reservedSpace0:3;
      uint64_t CRYPRST:1;
      uint64_t HSAHRST:1;
      uint64_t RNGRST:1;
      uint64_t OTGFSRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMCRST:1;
      uint64_t QSPIRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3RSTR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2RST:1;
      uint64_t TIM3RST:1;
      uint64_t TIM4RST:1;
      uint64_t TIM5RST:1;
      uint64_t TIM6RST:1;
      uint64_t TIM7RST:1;
      uint64_t TIM12RST:1;
      uint64_t TIM13RST:1;
      uint64_t TIM14RST:1;
      uint64_t LPTIM1RST:1;
      uint64_t reservedSpace0:1;
      uint64_t WWDGRST:1;
      uint64_t reservedSpace1:2;
      uint64_t SPI2RST:1;
      uint64_t SPI3RST:1;
      uint64_t SPDIFRXRST:1;
      uint64_t UART2RST:1;
      uint64_t UART3RST:1;
      uint64_t UART4RST:1;
      uint64_t UART5RST:1;
      uint64_t I2C1RST:1;
      uint64_t I2C2RST:1;
      uint64_t I2C3RST:1;
      uint64_t I2C4RST:1;
      uint64_t CAN1RST:1;
      uint64_t CAN2RST:1;
      uint64_t CECRST:1;
      uint64_t PWRRST:1;
      uint64_t DACRST:1;
      uint64_t UART7RST:1;
      uint64_t UART8RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM1RST:1;
      uint64_t TIM8RST:1;
      uint64_t reservedSpace0:2;
      uint64_t USART1RST:1;
      uint64_t USART6RST:1;
      uint64_t reservedSpace1:2;
      uint64_t ADCRST:1;
      uint64_t reservedSpace2:2;
      uint64_t SDMMC1RST:1;
      uint64_t SPI1RST:1;
      uint64_t SPI4RST:1;
      uint64_t SYSCFGRST:1;
      uint64_t reservedSpace3:1;
      uint64_t TIM9RST:1;
      uint64_t TIM10RST:1;
      uint64_t TIM11RST:1;
      uint64_t reservedSpace4:1;
      uint64_t SPI5RST:1;
      uint64_t SPI6RST:1;
      uint64_t SAI1RST:1;
      uint64_t SAI2RST:1;
      uint64_t reservedSpace5:2;
      uint64_t LTDCRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2RSTR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOAEN:1;
      uint64_t GPIOBEN:1;
      uint64_t GPIOCEN:1;
      uint64_t GPIODEN:1;
      uint64_t GPIOEEN:1;
      uint64_t GPIOFEN:1;
      uint64_t GPIOGEN:1;
      uint64_t GPIOHEN:1;
      uint64_t GPIOIEN:1;
      uint64_t GPIOJEN:1;
      uint64_t GPIOKEN:1;
      uint64_t reservedSpace0:1;
      uint64_t CRCEN:1;
      uint64_t reservedSpace1:5;
      uint64_t BKPSRAMEN:1;
      uint64_t reservedSpace2:1;
      uint64_t CCMDATARAMEN:1;
      uint64_t DMA1EN:1;
      uint64_t DMA2EN:1;
      uint64_t DMA2DEN:1;
      uint64_t reservedSpace3:1;
      uint64_t ETHMACEN:1;
      uint64_t ETHMACTXEN:1;
      uint64_t ETHMACRXEN:1;
      uint64_t ETHMACPTPEN:1;
      uint64_t OTGHSEN:1;
      uint64_t OTGHSULPIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMIEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CRYPEN:1;
      uint64_t HASHEN:1;
      uint64_t RNGEN:1;
      uint64_t OTGFSEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMCEN:1;
      uint64_t QSPIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3ENR;

