iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32F7xx/emptyTargetInit/STM32F7_sfr.h
};

#define DAC (*(volatile struct DAC_tag *) 0x40007400)

struct PWR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPDS:1;
      uint64_t PDDS:1;
      uint64_t reservedSpace0:1;
      uint64_t CSBF:1;
      uint64_t PVDE:1;
      uint64_t PLS:3;
      uint64_t DBP:1;
      uint64_t FPDS:1;
      uint64_t LPUDS:1;
      uint64_t MRUDS:1;
      uint64_t reservedSpace1:1;
      uint64_t ADCDC1:1;
      uint64_t VOS:2;
      uint64_t ODEN:1;
      uint64_t ODSWEN:1;
      uint64_t UDEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WUIF:1;
      uint64_t SBF:1;
      uint64_t PVDO:1;
      uint64_t BRR:1;
      uint64_t reservedSpace0:5;
      uint64_t BRE:1;
      uint64_t reservedSpace1:4;
      uint64_t VOSRDY:1;
      uint64_t reservedSpace2:1;
      uint64_t ODRDY:1;
      uint64_t ODSWRDY:1;
      uint64_t UDRDY:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWUPF1:1;
      uint64_t CWUPF2:1;
      uint64_t CWUPF3:1;
      uint64_t CWUPF4:1;
      uint64_t CWUPF5:1;
      uint64_t CWUPF6:1;
      uint64_t reservedSpace0:2;
      uint64_t WUPP1:1;
      uint64_t WUPP2:1;
      uint64_t WUPP3:1;
      uint64_t WUPP4:1;
      uint64_t WUPP5:1;
      uint64_t WUPP6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WUPF1:1;
      uint64_t WUPF2:1;
      uint64_t WUPF3:1;
      uint64_t WUPF4:1;
      uint64_t WUPF5:1;
      uint64_t WUPF6:1;
      uint64_t reservedSpace0:2;
      uint64_t EWUP1:1;
      uint64_t EWUP2:1;
      uint64_t EWUP3:1;
      uint64_t EWUP4:1;
      uint64_t EWUP5:1;
      uint64_t EWUP6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR2;

};

#define PWR (*(volatile struct PWR_tag *) 0x40007000)

struct IWDG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RL:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PVU:1;
      uint64_t RVU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WIN:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WINR;

};

#define IWDG (*(volatile struct IWDG_tag *) 0x40003000)

struct WWDG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t T:7;
      uint64_t WDGA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t W:7;
      uint64_t WDGTB0:1;
      uint64_t WDGTB1:1;
      uint64_t EWI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EWIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

};

#define WWDG (*(volatile struct WWDG_tag *) 0x40002c00)

struct C_ADC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWD1:1;
      uint64_t EOC1:1;
      uint64_t JEOC1:1;
      uint64_t JSTRT1:1;
      uint64_t STRT1:1;
      uint64_t OVR1:1;
      uint64_t reservedSpace0:2;
      uint64_t AWD2:1;
      uint64_t EOC2:1;
      uint64_t JEOC2:1;
      uint64_t JSTRT2:1;
      uint64_t STRT2:1;
      uint64_t OVR2:1;
      uint64_t reservedSpace1:2;
      uint64_t AWD3:1;
      uint64_t EOC3:1;
      uint64_t JEOC3:1;
      uint64_t JSTRT3:1;
      uint64_t STRT3:1;
      uint64_t OVR3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MULT:5;
      uint64_t reservedSpace0:3;
      uint64_t DELAY:4;
      uint64_t reservedSpace1:1;
      uint64_t DDS:1;
      uint64_t DMA:2;
      uint64_t ADCPRE:2;
      uint64_t reservedSpace2:4;
      uint64_t VBATE:1;
      uint64_t TSVREFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA1:16;
      uint64_t DATA2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR;

};

#define C_ADC (*(volatile struct C_ADC_tag *) 0x40012300)

struct TIM6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t UDIS:1;
      uint64_t URS:1;
      uint64_t OPM:1;
      uint64_t reservedSpace0:3;
      uint64_t ARPE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t MMS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UIE:1;
      uint64_t reservedSpace0:7;
      uint64_t UDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EGR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARR;

};

#define TIM6 (*(volatile struct TIM6_tag *) 0x40001000)

struct TIM7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t UDIS:1;
      uint64_t URS:1;
      uint64_t OPM:1;
      uint64_t reservedSpace0:3;
      uint64_t ARPE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t MMS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

