iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32F7xx/emptyTargetInit/STM32F7_sfr.h
};

#define EXTI (*(volatile struct EXTI_tag *) 0x40013c00)

struct LTDC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSH:11;
      uint64_t reservedSpace0:5;
      uint64_t HSW:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AVBP:11;
      uint64_t reservedSpace0:5;
      uint64_t AHBP:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AAH:11;
      uint64_t reservedSpace0:5;
      uint64_t AAV:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOTALH:11;
      uint64_t reservedSpace0:5;
      uint64_t TOTALW:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTDCEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DBW:3;
      uint64_t reservedSpace1:1;
      uint64_t DGW:3;
      uint64_t reservedSpace2:1;
      uint64_t DRW:3;
      uint64_t reservedSpace3:1;
      uint64_t DEN:1;
      uint64_t reservedSpace4:11;
      uint64_t PCPOL:1;
      uint64_t DEPOL:1;
      uint64_t VSPOL:1;
      uint64_t HSPOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IMR:1;
      uint64_t VBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BC:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCCR;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LIE:1;
      uint64_t FUIE:1;
      uint64_t TERRIE:1;
      uint64_t RRIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LIF:1;
      uint64_t FUIF:1;
      uint64_t TERRIF:1;
      uint64_t RRIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLIF:1;
      uint64_t CFUIF:1;
      uint64_t CTERRIF:1;
      uint64_t CRRIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LIPOS:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CYPOS:16;
      uint64_t CXPOS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VDES:1;
      uint64_t HDES:1;
      uint64_t VSYNCS:1;
      uint64_t HSYNCS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDSR;

  uint8_t res3[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEN:1;
      uint64_t COLKEN:1;
      uint64_t reservedSpace0:2;
      uint64_t CLUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WHSTPOS:12;
      uint64_t reservedSpace0:4;
      uint64_t WHSPPOS:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1WHPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WVSTPOS:11;
      uint64_t reservedSpace0:5;
      uint64_t WVSPPOS:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1WVPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKBLUE:8;
      uint64_t CKGREEN:8;
      uint64_t CKRED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1CKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PF:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1PFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONSTA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1CACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCBLUE:8;
      uint64_t DCGREEN:8;
      uint64_t DCRED:8;
      uint64_t DCALPHA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1DCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BF2:3;
      uint64_t reservedSpace0:5;
      uint64_t BF1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1BFCR;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFBADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1CFBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFBLL:13;
      uint64_t reservedSpace0:3;
      uint64_t CFBP:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1CFBLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFBLNBR:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1CFBLNR;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLUE:8;
      uint64_t GREEN:8;
      uint64_t RED:8;
      uint64_t CLUTADD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L1CLUTWR;

  uint8_t res6[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEN:1;
      uint64_t COLKEN:1;
      uint64_t reservedSpace0:2;
      uint64_t CLUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L2CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WHSTPOS:12;
      uint64_t reservedSpace0:4;
      uint64_t WHSPPOS:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L2WHPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WVSTPOS:11;
      uint64_t reservedSpace0:5;
      uint64_t WVSPPOS:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L2WVPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKBLUE:8;
      uint64_t CKGREEN:7;
      uint64_t CKRED:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L2CKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PF:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L2PFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONSTA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L2CACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCBLUE:8;
      uint64_t DCGREEN:8;
      uint64_t DCRED:8;
      uint64_t DCALPHA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L2DCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BF2:3;
      uint64_t reservedSpace0:5;
      uint64_t BF1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) L2BFCR;

